
# Scrapy Project Analyzing Zoo Data
## by Connor Haas

In [1]:
import pandas as pd
import numpy as np
import re

In [2]:
import csv
#extracting csv file with zoo name and data
zooDF = pd.read_csv(r'C:\Users\conma\Desktop\NYCDSA\Webscraping\ScrapyProject\zoo_data\zoodata.csv')
countryDF = pd.read_csv(r'C:\Users\conma\Desktop\NYCDSA\Webscraping\ScrapyProject\country_data\countrydata.csv')

In [3]:
zooDF

,address,city,country,name,name_url,num_animals,num_species,state
0,2070 Zoo Ln,Abilene,United States,Abilene Zoological Gardens,https://en.wikipedia.org/wiki/Abilene_Zoologic...,1100,>250,Texas
1,1 Wild Pl,Birmingham,United States,Birmingham Zoo,https://en.wikipedia.org/wiki/Birmingham_Zoo,~800,200+,Alabama
2,"USCD, 9500 Gilman Dr",La Jolla,United States,Birch Aquarium at Scripps,https://en.wikipedia.org/wiki/Birch_Aquarium,"3,000+",380,California
3,7400 Division Dr,Battle Creek,United States,Binder Park Zoo,https://en.wikipedia.org/wiki/Binder_Park_Zoo,500,140,Michigan
4,PO Box FL 145,Flatts Village,NaN,"Bermuda Aquarium, Museum and Zoo",https://en.wikipedia.org/wiki/Bermuda_Aquarium...,300,NaN,Bermuda
...,...,...,...,...,...,...,...,...
245,23 Science Center Rd,Holderness,United States,Squam Lakes Natural Science Center,https://en.wikipedia.org/wiki/Squam_Lakes_Natu...,NaN,NaN,New Hampshire
246,2300 Southern Blvd,Bronx,United States,Bronx Zoo,https://en.wikipedia.org/wiki/Bronx_Zoo,"4,000 (2010)",650 (2010),New York
247,3414 W St,Eureka,United States,Sequoia Park Zoo,https://en.wikipedia.org/wiki/Sequoia_Park_Zoo,Vertebrates: 195 (in 2013),54 (in 2013),California
248,2222 Saint Paul St.,Rochester,United States,Seneca Park Zoo,https://en.wikipedia.org/wiki/Seneca_Park_Zoo,NaN,NaN,New York
249,5555 W Zoo Blvd,Wichita,United States,Sedgwick County Zoo,https://en.wikipedia.org/wiki/Sedgwick_County_Zoo,"3,000",400,Kansas

In [4]:
countryDF

,city_2016_land_area,city_name,pop_2018,pop_density,state_name
0,"301.5Â sqÂ mi\n,468.7Â sqÂ mi\n,227.3Â sqÂ mi\n,637....","New York,[d],Los Angeles,Chicago,Houston,[3],P...","8,398,748\n,3,990,456\n,2,705,994\n,2,325,502\...","28,317/sqÂ mi\n,8,484/sqÂ mi\n,11,900/sqÂ mi\n,3,...","New York,\n,California,\n,Illinois,\n,Texas,\n..."
1,"102.3Â km,\n,69.9Â km,\n,53.6Â km,\n,79.5Â km,\n,2...","San Juan,BayamÃ³n,Carolina,Ponce,Caguas","395,326\n,208,116\n,176,762\n,166,327\n,142,893\n","3,297/km,\n,2,568/km,\n,2,881/km,\n,1,771/km,\...",NaN
2,"120.996Â km,\n,67.288Â km,\n,86.381Â km,\n,86.055...","Nevada,Virginia,Nevada,Nevada,Louisiana,Califo...","186,070\n,189,453\n,156,120\n,117,390\n,146,13...","1,844/km,\n,3,086/km,\n,2,192/km,\n,2,073/km,\...",NaN
3,"2.30% from 2000 to 2010\n,annexed by , in 1907...","New York,Pennsylvania,New York,New Jersey,Ohio...","(1950)\n, (1900)\n, (1890)\n, (1950)\n, (1950...",NaN,NaN

In [5]:
countryDF2 = pd.DataFrame([])
zooDF2 = pd.DataFrame([])

In [6]:
zooDF2['city_name'] = zooDF['city']
zooDF2['state'] = zooDF['state']
zooDF2['zoo_name'] = zooDF['name']
zooDF2['num_animals'] = zooDF['num_animals']
zooDF2['num_species'] = zooDF['num_species']
zooDF2

,city_name,state,zoo_name,num_animals,num_species
0,Abilene,Texas,Abilene Zoological Gardens,1100,>250
1,Birmingham,Alabama,Birmingham Zoo,~800,200+
2,La Jolla,California,Birch Aquarium at Scripps,"3,000+",380
3,Battle Creek,Michigan,Binder Park Zoo,500,140
4,Flatts Village,Bermuda,"Bermuda Aquarium, Museum and Zoo",300,NaN
...,...,...,...,...,...
245,Holderness,New Hampshire,Squam Lakes Natural Science Center,NaN,NaN
246,Bronx,New York,Bronx Zoo,"4,000 (2010)",650 (2010)
247,Eureka,California,Sequoia Park Zoo,Vertebrates: 195 (in 2013),54 (in 2013)
248,Rochester,New York,Seneca Park Zoo,NaN,NaN
249,Wichita,Kansas,Sedgwick County Zoo,"3,000",400

In [7]:
numSpec = zooDF2['num_species']
numSpec = numSpec.replace(r'\([^)]*\)',"",regex=True)
numSpec = numSpec.replace('[^0-9.]',"",regex=True)
zooDF2['num_species'] = numSpec
#list(map(lambda s: re.sub(r'\([^)]*\)', '', s),numSpec))
#numSpec

In [8]:
numAni = zooDF2['num_animals']
numAni = numAni.replace(r'\([^)]*\)',"",regex=True)
numAni = numAni.replace('[^0-9.]',"",regex=True)
zooDF2['num_animals'] = numAni
zooDF2

,city_name,state,zoo_name,num_animals,num_species
0,Abilene,Texas,Abilene Zoological Gardens,1100,250
1,Birmingham,Alabama,Birmingham Zoo,800,200
2,La Jolla,California,Birch Aquarium at Scripps,3000,380
3,Battle Creek,Michigan,Binder Park Zoo,500,140
4,Flatts Village,Bermuda,"Bermuda Aquarium, Museum and Zoo",300,NaN
...,...,...,...,...,...
245,Holderness,New Hampshire,Squam Lakes Natural Science Center,NaN,NaN
246,Bronx,New York,Bronx Zoo,4000,650
247,Eureka,California,Sequoia Park Zoo,195,54
248,Rochester,New York,Seneca Park Zoo,NaN,NaN
249,Wichita,Kansas,Sedgwick County Zoo,3000,400

In [9]:
#split landArea string and clean into dataframe
landArea = countryDF.loc[0,'city_2016_land_area'].split('\n')
#print("landArea", type(landArea))
landArea = list(map(lambda s: re.sub('[^0-9.]','',s),landArea))
landArea = list(map(lambda s: float(s),landArea[:-1]))
countryDF2['land_area'] = np.array(landArea)

#split city names string and clean into dataframe
city_name = countryDF.loc[0,'city_name'].split(',')
for e in city_name:
    if '[' in e:
        city_name.remove(e)
#np.array(city_name).size
countryDF2['city_name'] = np.array(city_name)

#split population of city and clean into dataframe
pop_2018 = countryDF.replace(',','',regex=True).loc[0,'pop_2018'].split('\n')
pop_2018 = list(map(lambda s: int(s),pop_2018[:-1]))
#np.array(pop_2018).size
countryDF2['pop_2018'] = np.array(pop_2018)

popD = countryDF.loc[0,'pop_density'].replace(',','').split('\n')
popD = list(map(lambda s: re.sub('[^0-9]','',s),popD))
popD = list(map(lambda s: int(s), popD[:-1]))
#np.array(popD).size
countryDF2['population_density'] = np.array(popD)

state_name = countryDF.loc[0,'state_name'].split('\n')
state_name = list(map(lambda s: re.sub(r'[,_]','',s),state_name[:-1]))
np.array(state_name).size
countryDF2['state_name']=np.array(state_name)

countryDF2

     land_area    city_name  pop_2018  population_density  state_name
0        301.5     New York   8398748               28317    New York
1        468.7  Los Angeles   3990456                8484  California
2        227.3      Chicago   2705994               11900    Illinois
3        637.5      Houston   2325502                3613       Texas
4        517.6      Phoenix   1660272                3120     Arizona
..         ...          ...       ...                 ...         ...
309       30.1       Edison    100693                3389  New Jersey
310       23.3   Woodbridge    100450                4351  New Jersey
311       59.9   San Angelo    100215                1681       Texas
312       28.0      Kenosha    100164                3577   Wisconsin
313       29.0    Vacaville    100154                3449  California

[314 rows x 5 columns]

In [16]:
zooDF3 = zooDF2.groupby(['city_name','state'])
zooDF3

# zooDF3['city_name'] = pd.DataFrame(list(map(lambda x: x.lower(), zooDF2.loc[:,'city_name'])))
# countryDF3 = countryDF2
# countryDF3['city_name'] = pd.DataFrame(list(map(lambda x: x.lower(), countryDF2.loc[:,'city_name'])))
#zooDF3
#zooDF3 = zooDF2.merge(countryDF2,how = 'left', on = 'city_name')
#zooDF3

#zooDF3['city_name'].unique()
#zooDF3.drop_duplicates()
#list(zooDF3[zooDF3.pop_2018.isna()]['city_name'])

In [208]:
landArea = countryDF.loc[0,'city_2016_land_area'].split('\n')
landArea = list(map(lambda s: re.sub('[^0-9.]','',s),landArea))
landArea = list(map(lambda s: float(s),landArea[:-1]))
countryDF2['land_area'] = np.array(landArea)
countryDF2

       city_name  pop_2018  Population_Density  land_area
0       New York   8398748               28317      301.5
1    Los Angeles   3990456                8484      468.7
2        Chicago   2705994               11900      227.3
3        Houston   2325502                3613      637.5
4        Phoenix   1660272                3120      517.6
..           ...       ...                 ...        ...
309       Edison    100693                3389       30.1
310   Woodbridge    100450                4351       23.3
311   San Angelo    100215                1681       59.9
312      Kenosha    100164                3577       28.0
313    Vacaville    100154                3449       29.0

[314 rows x 4 columns]

In [192]:
city_name = countryDF.loc[0,'city_name'].split(',')
for e in city_name:
    if '[' in e:
        city_name.remove(e)
np.array(city_name).size
countryDF2['city_name'] = np.array(city_name)
countryDF2

       city_name
0       New York
1    Los Angeles
2        Chicago
3        Houston
4        Phoenix
..           ...
309       Edison
310   Woodbridge
311   San Angelo
312      Kenosha
313    Vacaville

[314 rows x 1 columns]

In [193]:
pop_2018 = countryDF.replace(',','',regex=True).loc[0,'pop_2018'].split('\n')
pop_2018 = list(map(lambda s: int(s),pop_2018[:-1]))
np.array(pop_2018).size
countryDF2['pop_2018'] = np.array(pop_2018)
countryDF2

       city_name  pop_2018
0       New York   8398748
1    Los Angeles   3990456
2        Chicago   2705994
3        Houston   2325502
4        Phoenix   1660272
..           ...       ...
309       Edison    100693
310   Woodbridge    100450
311   San Angelo    100215
312      Kenosha    100164
313    Vacaville    100154

[314 rows x 2 columns]

In [194]:
popD = countryDF.loc[0,'pop_density'].replace(',','').split('\n')
popD = list(map(lambda s: re.sub('[^0-9]','',s),popD))
popD = list(map(lambda s: int(s), popD[:-1]))
np.array(popD).size
countryDF2['Population_Density'] = np.array(popD)
countryDF2

       city_name  pop_2018  Population_Density
0       New York   8398748               28317
1    Los Angeles   3990456                8484
2        Chicago   2705994               11900
3        Houston   2325502                3613
4        Phoenix   1660272                3120
..           ...       ...                 ...
309       Edison    100693                3389
310   Woodbridge    100450                4351
311   San Angelo    100215                1681
312      Kenosha    100164                3577
313    Vacaville    100154                3449

[314 rows x 3 columns]

In [21]:
state_name = countryDF.loc[0,'state_name'].split('\n')
state_name = list(map(lambda s: re.sub(r'[,_]','',s),state_name[:-1]))
np.array(state_name).size
countryDF2['state_name']=np.array(state_name)